# 7. ** Написать программу "Показать звезды". На вход принимает обычное целое число,
# должно напечатать количество звезд:
#
#      Пример:
#
#      Input number of stars: 8
#      ********

some_input = input('Input number of stars: ')
stars_number = int(some_input)
print('*' * stars_number)