#  Напишите программу, которая приветствует пользователя, выводя слово `Hello`,
#  введенное имя и знаки препинания по образцу:
#
# Hello, Kitty!
name = input('Enter your name:')
print('Hello, ' + name)