#  Напишите программу, которая приветствует пользователя, выводя слово `Hello`,
#  введенное имя и знаки препинания по образцу:
#
# Hello, Kitty!
print('Hello, ' + input('Enter your name:'))