# 2. Пользователь вводит действительное (вещественное) число `X`, которое имеет два знака после десятичной точки.
#
#    - Выведите его дробную часть.
#
#    - Выведите его первую цифру после десятичной точки.

# Выведите его дробную часть.
some_input = print(input('Enter a floating number: ') [-3:])

#    - Выведите его первую цифру после десятичной точки.
some_input_1 = print(input('Enter a floating number: ') [-2])