# Пользователь вводит трехзначное число. Найдите сумму его цифр.
some_input = sum([int(i) for i in input('Enter a 3-digit number: ')])
print(some_input)
